In [4]:
import numpy as np
import pandas as pd

In [28]:
df= pd.read_csv("messy_dataset.csv")
print(df)

     Name   Age         City  Marks   Join Date
0   Alice  22.0     New York   85.0  2024-01-15
1     bob  19.0      chicago   90.0  2023/12/20
2  Clara    NaN  Los Angeles   78.0  15-02-2024
3   David  25.0     new york   88.0  2024.03.10
4     Eva  20.0      Chicago    NaN  2024-05-01
5   Frank  23.0          NaN   92.0  2023-11-30
6    Gina  21.0  los angeles   75.0         NaN
7   Henry  29.0      Chicago   60.0  2024/07/15
8     Ivy   NaN     New York   55.0  2024-08-01
9     NaN  24.0      chicago    NaN  2024-08-15

In [29]:
df.shape

(10, 5)

In [30]:
# removign rows that have null values
df.dropna()

     Name   Age      City  Marks   Join Date
0   Alice  22.0  New York   85.0  2024-01-15
1     bob  19.0   chicago   90.0  2023/12/20
3   David  25.0  new york   88.0  2024.03.10
7   Henry  29.0   Chicago   60.0  2024/07/15

In [31]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       9 non-null      object
 1   Age        8 non-null      float64
 2   City       9 non-null      object
 3   Marks      8 non-null      float64
 4   Join Date  9 non-null      object
dtypes: float64(2), object(3)
memory usage: 532.0+ bytes
None

In [ ]:
df["Join Date"] = pd.to_datetime(df["Join Date"], errors="coerce")

print(df)